In [2]:
#1 import pandas
import pandas as pd

In [9]:
#2 datatypes
cars =pd.Series(["BMW", "Toyota", "Honda"])

In [10]:
#3 view series
cars

0       BMW
1    Toyota
2     Honda
dtype: object

In [11]:
colors =pd.Series(["Blue", "Red", "Green"])
colors

0     Blue
1      Red
2    Green
dtype: object

In [12]:
cars_data = pd.DataFrame({"Car Make":cars, "Colors":colors})

In [13]:
cars_data

  Car Make Colors
0      BMW   Blue
1   Toyota    Red
2    Honda  Green

In [17]:
#Import dataset
cars_sale = pd.read_csv("car-sales.csv")

In [18]:
cars_sale

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [24]:
# Export Dataset
cars_sale.to_csv("exported_CSV.csv", index=False)

In [25]:
ds2 = pd.read_csv("exported_CSV.csv")

In [26]:
ds2

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00